
 
// // //  //loop 


// // //   რიცხვების დაბეჭდვა 1-დან 10-მდე:  for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 10-მდე. 

// // // ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 10-მდე. 

// // // for (let i=1; i<10 ; i++ ) {
// // //    console.log(i);
// // // }


// // // let i=1;
// // // while(i<10) {
// // //     console.log(i);
// // //     i++;
// // // }



// // // ლუწი რიცხვების დაბეჭდვა 2-დან 20-მდე: for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს ლუწ რიცხვებს 2-დან 20-მდე. 

// // // ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს ლუწ რიცხვებს 2-დან 20-მდე. 


// // // for (let i=2; i<20 ; i++) {
// // //       console.log(i);
// // //    }

// // // //   რიცხვების ამოწერა უკუღმა:  for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე.
// // // //  ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე. 


// // // for (let i = 10; i > 0 ; i--){
// // //     console.log(i);
// // // }

// // // let i = 10;
// // // while (i> 0){
// // //     console.log(i);
// // //     i --;
// // // }


// // // რიცხვების 2 დან 20 დამწერა. ლუწის

// // // for (let i=2; i<20 ; i+=2  ) {
// // //     console.log(i);
// // //  }

// // //   რიცხვის ლუწი ან კენტი შემოწმება: 

// // // დაწერეთ კოდი, რომელიც იღებს რიცხვს და ამოწმებს, არის თუ არა ის ლუწი თუ კენტი. თუ რიცხვი ლუწია, დაბეჭდეთ "რიცხვი ლუწია", ხოლო თუ კენტია - "რიცხვი კენტია".



// // //   რიცხვის დადებითი, უარყოფითი ან ნულის შემოწმება: 

// // // დაწერეთ კოდი, რომელიც იღებს რიცხვს და ამოწმებს, არის თუ არა ის დადებითი, უარყოფითი ან ნული. შესაბამისად, დაბეჭდეთ "რიცხვი დადებითია", "რიცხვი უარყოფითია" ან "რიცხვი ნულია". 
// // // let number = -1
// // // if (number > 0) {
// // //     console.log('დადებითია')
// // // }
// // //  else if (number <0) {
// // //      console.log('უარყოფითია')
// // //  }
// // //   else {
// // //     console.log('ნულია')
// // //  }



// // //   სტუდენტის შეფასების განსაზღვრა ქულის მიხედვით: 

// // // დაწერეთ კოდი, რომელიც იღებს სტუდენტის ქულას (0-დან 100-მდე) და დაბეჭდავს შესაბამის შეფასებას შემდეგი კრიტერიუმების მიხედვით: 

// // // 90-100: "A" 

// // // 80-89: "B" 

// // // 70-79: "C" 

// // // // 60-69: "D" 

// // // // 0-59: "F" 

// // // let score =80;
// // // if (score >= 90 && score<=100) {
// // // console.log("A");
// // // }else if (score  >= 80 && score <= 89){
// // //     console.log("B");

// // //  }else if (score  >= 70 && score <= 79){
// // //   console.log("C"); 
// // //  } else if (score  >= 60 && score <= 69) {
// // //   console.log("D");
// // // } else if (score >= 0 && score <= 59 ){
// // //     console.log("F");
// // //  }
// // //    else (score < 0) {
// // //     console.log("feil");
// // // }


// // //   ასაკის მიხედვით კატეგორიის განსაზღვრა: 

// // // დაწერეთ კოდი, რომელიც იღებს პირის ასაკს და დაბეჭდავს შესაბამის კატეგორიას: 

// // // 0-12 წელი: "ბავშვი" 

// // // 13-17 წელი: "მოზარდი" 

// // // 18-64 წელი: "ზრდასრული" 

// // // 65 და მეტი: "ხანდაზმული" 


// // // let age =60;
// // // if (age >= 0 && age<=12) {
// // // console.log("ბავშვი" );
// // // }else if (age >=13  && age<=17){
// // //     console.log("მოზარდი");

// // // }else if (age >=18  && age<=64){
// // //     console.log("ზრდასრული" );
// // // }

// // // else if (age >65 ){
// // //     console.log("ხანდაზმული" );
// // // }

// // // else  {
// // //     console.log("კიდევ ცადე" );
// // // }
  


// // // რიცხვების ჯამის გამოთვლა 1-დან 100-მდე: 

// // // for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით გამოთვლის რიცხვების ჯამს 1-დან 100-მდე. 
// // // //   let sum =0;
// // // // for (let i=1; i<= 100; i++ ){
// // //     sum =sum+i 
// // // }
// // // console.log(sum);



// // //   რიცხვების დაბეჭდვა 1-დან 10-მდე: 

// // // for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 10-მდე. 

// // // ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 10-მდე. 

// // // for (i=0; i<10; i++){
// // //     console.log(i);
// // // }
// // // i=0;
// // // while(i<10)
// // // {
// // //     console.log(i);
// // //     i++;
// // // }

// // //   ლუწი რიცხვების დაბეჭდვა 2-დან 20-მდე: 

// // // for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს ლუწ რიცხვებს 2-დან 20-მდე. 

// // // ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს ლუწ რიცხვებს 2-დან 20-მდე. 


// // // for(i=2; i<20; i+=2 ){
// // //     console.log(i);
// // // }



// // //  ( არ არის სავალდებულო) რიცხვების ჯამის გამოთვლა 1-დან 100-მდე: 

// // // for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით გამოთვლის რიცხვების ჯამს 1-დან 100-მდე. 

// // // while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით გამოთვლის რიცხვების ჯამს 1-დან 100-მდე. 
// // let sum = 0;
// // for(let i = 1; i <= 100; i++){
// //     sum = sum + i;
    
// // }

// // console.log(sum);
// // //   რიცხვების ამოწერა უკუღმა: 

// // // for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე. 

// // // ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე. 
// // // for( i=10; i>0; i--){
// // //     console.log(i)
// // // }


// //   რიცხვის ლუწი ან კენტი შემოწმება: 

// // // დაწერეთ კოდი, რომელიც იღებს რიცხვს და ამოწმებს, არის თუ არა ის ლუწი თუ კენტი. თუ რიცხვი ლუწია, დაბეჭდეთ "რიცხვი ლუწია", ხოლო თუ კენტია - "რიცხვი კენტია". 

// // let number=51;
// //  if(number % 2 ===0){
// //     console.log('luwia')

// //  }
// // else{
// //     console.log('kentia')
// // }




// //   რიცხვის დადებითი, უარყოფითი ან ნულის შემოწმება: 

// // დაწერეთ კოდი, რომელიც იღებს რიცხვს და ამოწმებს, არის თუ არა ის დადებითი, უარყოფითი ან ნული. შესაბამისად, დაბეჭდეთ "რიცხვი დადებითია", "რიცხვი უარყოფითია" ან "რიცხვი ნულია". let number = -5;
// // if(number>0){
// //     console.log('დადებითია')
// // }
// // else if(number<0){
// //     console.log('uaryofi?Tia')
// // }
// // else{
// //     console.log('nulia')
// // }

// // ( არ არის სავალდებულო)წლის ნაკიანობის შემოწმება: 

// // დაწერეთ კოდი, რომელიც იღებს წელს და ამოწმებს, არის თუ არა ის ნაკიანი. ნაკიანი წელია, რომელიც იყოფა 4-ზე, მაგრამ არ იყოფა 100-ზე, 
// // გარდა იმ შემთხვევისა, როცა ის იყოფა 400-ზე. თუ წელი ნაკიანია, დაბეჭდეთ "წელი ნაკიანია", წინააღმდეგ შემთხვევაში - "წელი არ არის ნაკიანი". 

// // let year =2025;
// // if((year % 4 ===0 && year %100 !== 0) || year % 400 ===0)
// // {
// //     console.log('ნაკიანი')
// // }
// // else{
// //     console.log('ar aris nakiani')
// // }



// //   რიცხვის ციფრების რაოდენობის განსაზღვრა: 

// // დაწერეთ კოდი, რომელიც იღებს რიცხვს და დაბეჭდავს შეტყობინებას, თუ რამდენი ციფრი აქვს მას. მაგალითად, თუ რიცხვი არის 123, დაბეჭდეთ "რიცხვს აქვს 3 ციფრი".

// //  let number = 1245;
// //  let result = number.toString().length
// //  console.log(result.length)



// //   ( არ არის სავალდებულო)დღის ტიპის განსაზღვრა: 

// // დაწერეთ კოდი, რომელიც იღებს კვირის დღის ნომერს (1-დან 7-მდე, სადაც 1 შეესაბამება ორშაბათს და 7 - კვირას) და დაბეჭდავს შეტყობინებას, არის თუ არა ეს დღე სამუშაო დღე თუ დასვენების დღე. 

// //  let day = 7;
// //  if(day > 1 && day <6 ){
// //     console.log('samuSao dRe')
// //  }
// //  else if (day => 6 && day <= 7 ){
// //     console.log('dasveneba')
// //  }
// //  else{
// //     console.log('ar Seesabameba')
// //  }

// // // let day =4;
// // // let result =day >1 && day <6 ? 'samuSap' : "არასამუშაო"
// // // console.log(result)

// // let number=[1,2,5,8]

// // for(let num of number)
// // {
// //     console.log(num)
// // }


// /////  07.02.2025

// // //   რიცხვების დაბეჭდვა 1-დან 10-მდე:  
// // for(let num of i);
// // {consol.log(num);}

// // // for (let i=1; i<10 ; i++ ) {
// // //    console.log(i);
// // // }


// /

// // // ლუწი რიცხვების დაბეჭდვა 2-დან 20-მდე: for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს ლუწ რიცხვებს 2-დან 20-მდე. 


// // // for (let i=2; i<20 ; i++) {
// // //       console.log(i);
// // //    }

// // // //   რიცხვების ამოწერა უკუღმა:  for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე.
// // // //  ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე. 


// // // for (let i = 10; i > 0 ; i--){
// // //     console.log(i);
// // // }




// // // რიცხვების 2 დან 20 დამწერა. ლუწის

// // // for (let i=2; i<20 ; i+=2  ) {
// // //     console.log(i);
// // //  }

// // //   რიცხვის ლუწი ან კენტი შემოწმება: 

// // // დაწერეთ კოდი, რომელიც იღებს რიცხვს და ამოწმებს, არის თუ არა ის ლუწი თუ კენტი. თუ რიცხვი ლუწია, დაბეჭდეთ "რიცხვი ლუწია", ხოლო თუ კენტია - "რიცხვი კენტია".



// // //   რიცხვის დადებითი, უარყოფითი ან ნულის შემოწმება: 




//  let number = 1 ;
//  let result = number > 0 ? 'დადებითი'  
//     : number < 0 ? 'უარყოფითი' : 'ნული' 
//  console.log(result);
                        




//    სტუდენტის შეფასების განსაზღვრა ქულის მიხედვით: 


// let score = 80;
// let result = score >= 90 && score <=100 ? 'A'
//  : score >= 80 && score <=89 ? 'B' 
//  : score >= 70 && score <=79 ? 'C' 
//  : score >= 60 && score <=69 ? 'D' 
//  : score >= 0 && score <=59 ? 'D' : 'false'
//  console.log(result);



// // //   ასაკის მიხედვით კატეგორიის განსაზღვრა: 

// let age = 60;
// let result = age >=0 && age <= 12 ? 'bavSvi' 
//  :age >=13  && age<=17 ? 'mozardi'
//  :age >=18  && age<=64 ? 'zrdasruli'
//  : 'xandazmuli'
//  console.log(result );

  


// // // რიცხვების ჯამის გამოთვლა 1-დან 100-მდე: 
// // // //   let sum =0;
// // // // for (let i=1; i<= 100; i++ ){
// // //     sum =sum+i 
// // // }
// // // console.log(sum);



// // //   რიცხვების დაბეჭდვა 1-დან 10-მდე: 
// for (i=0; i<10; i++){
// // //     console.log(i);}


// // //   ლუწი რიცხვების დაბეჭდვა 2-დან 20-მდე: 

// // // for(i=2; i<20; i+=2 ){
// // //     console.log(i);
// // // }



// რიცხვების ჯამის გამოთვლა 1-დან 100-მდე: 
 
// // let sum = 0;
// // for(let i = 1; i <= 100; i++){
// //     sum = sum + i;
    
// // }

// // console.log(sum);
// // //   რიცხვების ამოწერა უკუღმა: . 
// // // for( i=10; i>0; i--){
// // //     console.log(i)
// // // }


// // //   რიცხვის ლუწი ან კენტი შემოწმება: 
// let number=51;
// let result = number %2 ===0 ? 'ლუწი' : 'კენტი'
// console.log(result)




// // //   რიცხვის დადებითი, უარყოფითი ან ნულის შემოწმება: 
// let number =5;
// let result = number >0 ? 'დადებითი'  : 'უარყოფითი'
//     console.log(result)


//წლის ნაკიანობის შემოწმება: 
// // დაწერეთ კოდი, რომელიც იღებს წელს და ამოწმებს, არის თუ არა ის ნაკიანი. ნაკიანი წელია, რომელიც იყოფა 4-ზე, მაგრამ არ იყოფა 100-ზე, 
// // გარდა იმ შემთხვევისა, როცა ის იყოფა 400-ზე. თუ წელი ნაკიანია, დაბეჭდეთ "წელი ნაკიანია", წინააღმდეგ შემთხვევაში - "წელი არ არის ნაკიანი". 
// let year =2025;
// let result = (year % 4 ===0 && year %100 !== 0) || year % 400 ===0 ? 'ნაკიანი'
// :'ar aris nakiani'
// console.log(result)



// // //   რიცხვის ციფრების რაოდენობის განსაზღვრა: 
//  let number = 1245;
//  let result = number.toString().length
//  console.log(result.length)



 

//  დაწერეთ კოდი, რომელიც იღებს კვირის დღის ნომერს (1-დან 7-მდე, სადაც 1 შეესაბამება ორშაბათს და 7 - კვირას) და დაბეჭდავს შეტყობინებას, არის თუ არა ეს დღე სამუშაო დღე თუ დასვენების დღე. 

// let day = 7;
// let result= day > 1 && day <6 ? ' samuSao dRe'
//   : day >= 6 && day <= 7 ? 'dasveneba'
//    : 'ar Seesabameba'
//    console.log(result)


// function sum (a,b)
// { return a+b}

//  let result=sum(7,9)
//  console.log(result)



// function calcDay( day)
// {

//     let result= day > 1 && day <6 ? ' samuSao dRe'
//      : day >= 6 && day <= 7 ? 'dasveneba'
//        : 'ar Seesabameba'
//        return result
// }


// let m =calcDay(5)
// console.log(m)


// function min(a,b)
// {
//     return a-b;
// }

// let result= min(6,4)
// console.log(result)

//სიმბოლოების დათვლა

function st(a)
{ return  a.length

}
let result = st('mariiiiii');
console.log(result);

