
 
//  //loop 


//   რიცხვების დაბეჭდვა 1-დან 10-მდე:  for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 10-მდე. 

// ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 10-მდე. 

// for (let i=1; i<10 ; i++ ) {
//    console.log(i);
// }


// let i=1;
// while(i<10) {
//     console.log(i);
//     i++;
// }



// ლუწი რიცხვების დაბეჭდვა 2-დან 20-მდე: for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს ლუწ რიცხვებს 2-დან 20-მდე. 

// ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს ლუწ რიცხვებს 2-დან 20-მდე. 


// for (let i=2; i<20 ; i++) {
//       console.log(i);
//    }

// //   რიცხვების ამოწერა უკუღმა:  for ციკლით: დაწერეთ კოდი, რომელიც for ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე.
// //  ( არ არის სავალდებულო)while ციკლით: დაწერეთ კოდი, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 10-დან 1-მდე. 


// for (let i = 10; i > 0 ; i--){
//     console.log(i);
// }

// let i = 10;
// while (i> 0){
//     console.log(i);
//     i --;
// }


//   რიცხვის ლუწი ან კენტი შემოწმება: 

// დაწერეთ კოდი, რომელიც იღებს რიცხვს და ამოწმებს, არის თუ არა ის ლუწი თუ კენტი. თუ რიცხვი ლუწია, დაბეჭდეთ "რიცხვი ლუწია", ხოლო თუ კენტია - "რიცხვი კენტია".



//   რიცხვის დადებითი, უარყოფითი ან ნულის შემოწმება: 

// დაწერეთ კოდი, რომელიც იღებს რიცხვს და ამოწმებს, არის თუ არა ის დადებითი, უარყოფითი ან ნული. შესაბამისად, დაბეჭდეთ "რიცხვი დადებითია", "რიცხვი უარყოფითია" ან "რიცხვი ნულია". 
// let number = -1
// if (number > 0) {
//     console.log('დადებითია')
// }
//  else if (number <0) {
//      console.log('უარყოფითია')
//  }
//   else {
//     console.log('ნულია')
//  }



//   სტუდენტის შეფასების განსაზღვრა ქულის მიხედვით: 

// დაწერეთ კოდი, რომელიც იღებს სტუდენტის ქულას (0-დან 100-მდე) და დაბეჭდავს შესაბამის შეფასებას შემდეგი კრიტერიუმების მიხედვით: 

// 90-100: "A" 

// 80-89: "B" 

// 70-79: "C" 

// // 60-69: "D" 

// // 0-59: "F" 

// let score =80;
// if (score >= 90 && score<=100) {
// console.log("A");
// }else if (score  >= 80 && score <= 89){
//     console.log("B");

//  }else if (score  >= 70 && score <= 79){
//   console.log("C"); 
//  } else if (score  >= 60 && score <= 69) {
//   console.log("D");
// } else if (score >= 0 && score <= 59 ){
//     console.log("F");
//  }
//    else (score < 0) {
//     console.log("feil");
// }


//   ასაკის მიხედვით კატეგორიის განსაზღვრა: 

// დაწერეთ კოდი, რომელიც იღებს პირის ასაკს და დაბეჭდავს შესაბამის კატეგორიას: 

// 0-12 წელი: "ბავშვი" 

// 13-17 წელი: "მოზარდი" 

// 18-64 წელი: "ზრდასრული" 

// 65 და მეტი: "ხანდაზმული" 


let age =60;
if (age >= 0 && age<=12) {
console.log("ბავშვი" );
}else if (age >=13  && age<=17){
    console.log("მოზარდი");

}else if (age >=18  && age<=64){
    console.log("ზრდასრული" );
}

else if (age >65 ){
    console.log("ხანდაზმული" );
}
  